{
    "movieReview": [
        {
            "id": 1,
            "movieName": "Whisper of the Heart - วันนั้น วันไหน หัวใจบรรเลง",
            "movieLength": 115,
            "director": "Hirakawa Yuichiro",
            "category": "หนังรักโรแมนติก",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_12/original/221203120331TqQ.jpg",
            "trailer": "https://www.youtube.com/embed/u2QNy_usYuA",
            "review": {
                "review": "Whisper of the Heart - วันนั้น วันไหน หัวใจบรรเลง เป็นหนังที่ดัดแปลงมาจากอนิเมะชื่อเดียวกันของ Ghibli (แต่ภาษาไทยคนละชื่อ โดยฉบับอนิเมะใช้ชื่อว่า วันนั้น...วันไหน หัวใจจะเป็นสีชมพู) ซึ่งหนังเรื่องนี้ไม่เพียงแต่ Remake ใหม่มาเป็นฉบับ Live-action มันยังเป็นทั้งภาคต่อที่จะได้เห็นเรื่องราวการเติบโตของตัวละครด้วย ในแบบฉบับของผู้สร้างเองด้วย คำถามแรก คงมีคนสงสัยแน่ว่าถ้าไม่เคยดูฉบับอนิเมะมาจะดูรู้เรื่องมั้ย คำตอบคือ ดูรู้เรื่อง เพราะถึงแม้จะบอกไปว่ามันเป็นภาคต่อ แต่ตัวหนังก็มีเหตุการณ์ย้อนอดีตในช่วงวัยเด็กที่เป็นอนิเมะมาให้เราดูอยู่บ้าง แต่ถ้าหากจะให้แนะนำ ถ้าตัดสินใจจะดูหนังเรื่องนี้แล้ว ไม่ว่าก่อนหรือหลังก็ต้องไปหาอนิเมะเรื่องนี้ดู และเราดูหนังก่อนดูอนิเมะ เพราะมีอะไรหลายจุดที่มันไม่เหมือนกับในหนัง ทั้งรายละเอียดเล็กน้อย และรายละเอียดหลัก เช่น ความฝันของพระเอกเซอิจิที่เปลี่ยนจากช่างทำไวโอลินกลายเป็นนักดนตรีเชลโล่มืออาชีพ หรืออย่างงานเขียนแรกของนางเอกชิซึคุจากที่ให้ปู่ของเซอิจิอ่านก็กลายเป็นให้เซอิจิอ่านคนแรก อีกทั้งยังมีประเด็นหลายอย่างที่หนังก็ไม่ได้เล่าจากอนิเมะเช่นกัน แต่ในมุมมองของเราก็ผิดหวังในด้านความเป็นหนังหลังดูจบไปแล้วรอบนึง พอได้ดูอนิเมะก็ยิ่งผิดหวังกับหนังเข้าไปใหญ่ ขาดเสน่ห์แบบสุด ๆ",
                "score": {
                    "screenPlay": 4,
                    "playing": 4,
                    "music": 7,
                    "actorSkills": 6,
                    "graphics": 7,
                    "average": 5.6
                }
            }
        },
        {
            "id": 2,
            "movieName": "BLACK PANTHER: WAKANDA FOREVER - แบล็ค แพนเธอร์: วาคานด้าจงเจริญ",
            "movieLength": 161,
            "director": "Ryan Coogler",
            "category": "หนังต่อสู้แอกชันหนังผจญภัย",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_11/original/2533_22110913312505.jpg",
            "trailer": "https://www.youtube.com/embed/_Z3QKkl1WyM",
            "review": {
                "review": "หนังเรื่องนี้สนุกมั้ย ตอบตามตรงว่าไม่ เพราะด้วยความที่ขาด Chadwick Boseman ตัวละครอื่นก็ขาดเสน่ห์ หนังจึงจำใจต้องมาในแนวทางแบบนี้อย่างหลีกเลี่ยงไม่ได้ ก็พอเข้าใจได้ แต่พอทำออกมาแล้วมันไม่สุด ไม่ถึงจุด จึงทำให้รู้สึกเฉย ๆ ไปกับทั้งเรื่องเลย ",
                "score": {
                    "screenPlay": 5,
                    "playing": 5,
                    "music": 5,
                    "actorSkills": 8,
                    "graphics": 7,
                    "average": 6
                }
            }
        },
        {
            "id": 3,
            "movieName": "The Menu - เมนูสยอง",
            "movieLength": 106,
            "director": "Mark Mylod",
            "category": "หนังตลกหนังผี",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_11/original/221102120327C46.jpg",
            "trailer": "https://www.youtube.com/embed/CAWZMssP3gM",
            "review": {
                "review": "นี่เป็นหนังที่เปรียบเสมือนเราได้เข้าไปนั่งกินอาหารกับเหล่าแขกพิเศษบนเกาะนั้นเลย ไม่ใช่ในแง่ของกายภาพ แต่เป็นในแง่ของความรู้สึก ในขณะที่ในหนังตัวละครต้องลุ้นว่าจานต่อไปจะเจออะไร ทางฝั่งคนดูอย่างเราก็ต้องคอยลุ้นว่าหนังจะเสิร์ฟให้เราได้เห็นอะไร หนังดำเนินเรื่องได้อย่างน่าติดตาม ค่อย ๆ ไต่ระดับความน่าสนใจไปทีละจานอาหารที่เสิร์ฟผ่านในเรื่องได้อย่างชาญฉลาด ผ่านบรรยากาศที่ไม่น่าไว้วางใจ บวกกับปริศนาต่าง ๆ ของแต่ละตัวละครที่มารวมกันอยู่ ณ ร้านอาหารบนเกาะที่ตัดขาดจากโลกภายนอกแบบนี้ เป็นคอร์สหลากรสชาติที่มีทั้งความฉงนชวนสงสัย ความสนุก ตลกร้าย ตื่นเต้น ระทึก สยองขวัญ ที่ไต่ระดับไปเรื่อย ๆ",
                "score": {
                    "screenPlay": 7,
                    "playing": 8,
                    "music": 7,
                    "actorSkills": 9,
                    "graphics": 7,
                    "average": 7.6
                }
            }
        },
        {
            "id": 4,
            "movieName": "OMG! รักจังวะ..ผิดจังหวะ - OMG Rak Jang Wa..Pit Jang Wah",
            "movieLength": 125,
            "director": "ฐิติพงศ์ เกิดทองทวี",
            "category": "หนังตลกหนังไทย",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_10/original/221019140319377.jpg",
            "trailer": "https://www.youtube.com/embed/MPqQ9Yo9XWA",
            "review": {
                "review": "นี่เป็นหนัง GDH เรื่องแรก ไล่ย้อนไปยัน GTH เลยก็ได้ ที่ดูจบแล้วไม่รู้ว่าต้องรู้สึกยังไง มันรู้สึกแปลก ๆ ไปเสียหมด เหมือนไม่ได้อะไรกลับไปจากหนังเรื่องนี้เลยแม้แต่น้อย ซึ่งองค์แรกและองค์สองของหนังมันก็ให้ความรู้สึกเหมือนหนัง GDH ทั่วไป จังหวะการยิงมุกต่าง ๆ ที่ขำบ้างไม่ขำบ้าง วิธีการดำเนินเรื่องต่าง ๆ ซึ่งองค์นี้จังหวะหลายอย่างค่อนข้างดีนะ มาถูกที่ถูกทางเลย พอเข้าองค์สาม หนังเริ่มเปลี่ยนแนว ใส่ความดราม่าเข้ามาให้ตัวละครเผชิญเรื่องราวต่าง ๆ กับคำว่า รักแฟนคนอื่น ซึ่ง...ตัวหนังก็พยายามปูบทให้ กาย พระเอกของเราต้องแย่งจูนที่เป็นแฟนคนอื่นมาให้ได้",
                "score": {
                    "screenPlay": 3,
                    "playing": 6,
                    "music": 9,
                    "actorSkills": 6.5,
                    "graphics": 9,
                    "average": 6.7
                }
            }
        },
        {
            "id": 5,
            "movieName": "แอน - Faces of Anne",
            "movieLength": 116,
            "director": "คงเดช จาตุรันต์รัศมี, ราสิเกติ์ สุขกาล",
            "category": "หนังระทึกขวัญหนังไทย",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_09/original/220927150014ueM.jpg",
            "trailer": "https://www.youtube.com/embed/dCOubUPaCeQ",
            "review": {
                "review": "ต้องขอบอกก่อนว่านี่ไม่ใช่หนังแนวไล่เชือด slasher จ๋า ๆ ที่บอกเล่าชั้นเดียวทื่อ ๆ แบบนั้น แต่มันเป็นหนังจิตวิทยาที่ใส่ความเป็น slasher เข้ามาเพื่อเป็นเครื่อมือหนึ่งในการบอกเล่าเรื่องราวเท่านั้น เป็นแนวจิตวิทยาระทึกขวัญที่เขียนบทได้อย่างชาญฉลาด ร้อยเรียงเรื่องราวได้ดี ที่ในระหว่างทางที่จุดให้เราได้ขบคิดตลอดทั้งเรื่อง คือแทบจะทุกจุดในเรื่องสำคัญหมด ละสายตาไม่ได้เลย นับตั้งแต่วินาทีแรกของหนังยันวินาทีสุดท้ายของหนังจนภาพดำเลย คือตลอดทั้งเรื่องหนังจะใส่ข้อมูลต่าง ๆ นานา ให้เราได้คิด สงสัย สับสน งงงวย เหมือนโยนจิ๊กซอว์มาทีละชิ้นให้เราไปต่อเอง",
                "score": {
                    "screenPlay": 9,
                    "playing": 9,
                    "music": 8,
                    "actorSkills": 7,
                    "graphics": 10,
                    "average": 8.6
                }
            }
        },
        {
            "id": 6,
            "movieName": "The Witch: Part 2. The Other One - แม่มด มือสังหาร",
            "movieLength": 140,
            "director": "Park Hoon-jung",
            "category": "หนังระทึกขวัญ",
            "picture": "https://movie.thaiware.com/upload_misc/movie/2022_07/original/220703120017Z4O.jpg",
            "trailer": "https://www.youtube.com/embed/G4_Wbdl3PIQ",
            "review": {
                "review": "แอ็คชันล้ำขึ้น เยอะขึ้น จัดเต็มขึ้นแต่ขาดเสนห์ความระทึกไม่ค่อยมีความน่ากลัวความสยองแบบภาคแรก",
                "score": {
                    "screenPlay": 7,
                    "playing": 7,
                    "music": 7,
                    "actorSkills": 7,
                    "graphics": 7,
                    "average": 7
                }
            }
        }
    ]
}