[{
    "ISBN":9786160821631,
    "Title":"โครงสร้างข้อมูล (Data Structures) เพื่อการออกแบบโปรแกรมคอมพิวเตอร์ (ฉบับปรับปรุง)",
    "Description":"โครงสร้างข้อมูล (Data Structures) จัดเป็นวิชาหนึ่งในสาขาคอมพิวเตอร์ที่นำมาซึ่งความตื่นเต้นและความท้าทายแก่ผู้เรียนอยู่ไม่น้อย ความน่าตื่นเต้นในที่นี้คือ เราจะได้ศึกษาถึงเทคนิคการเขียนโปรแกรมที่มีอยู่มากมาย เพื่อนำมาแก้ไขปัญหาทางคอมพิวเตอร์ ส่วนความท้าทายก็คือ ความยุ่งยากและความซับซ้อนของโครงสร้างข้อมูล จะนำมาซึ่งแนวความคิดอันหลากหลาย ที่สามารถนำมาประยุกต์ใช้กับวิธีการออกแบบโปรแกรมที่เหมาะสมต่อไป ภายในหนังสือเล่มนี้ได้แบ่งเนื้อหาออกเป็น 4 ส่วนด้วยกัน ซึ่งครอบคลุมเนื้อหาเกี่ยวกับโครงสร้างข้อมูล อันได้แก่ อาร์เรย์ ลิงก์ลิสต์ สแต็ก คิว ทรี และ กราฟ รวมถึงเทคนิคการจัดเรียงลำดับและการค้นหาข้อมูล เหมาะสำหรับใช้เป็นหนังสือประกอบการเรียนของคณาจารย์ นิสิตนักศึกษา รวมถึงผู้สนใจทั่วไปที่ต้องการเพิ่มพูนความรู้ศาสตร์วิชาโครงสร้างข้อมูล",
    "Author":"โอภาส เอี่ยมสิริวงศ์",
    "Year of publication":2016,
    "Price":219,
    "Picture":"9786160821631.jpg"
},{
    "ISBN":9786162047886,
    "Title":"Python สำหรับงาน Data Science Data Visualization และ Machine Learning",
    "Description":"หนังสือเล่มนี้จะสอนงาน Data Science ต่างๆ โดยใช้ภาษา Python เนื่องจากไพธอนเป็นภาษาโปรแกรมมิ่งที่เข้าใจง่าย อีกทั้งยังมีไลบรารีต่างๆ สำหรับงาน Data Science ให้เรียกใช้งานด้วย จึงทำให้การเขียนโปรแกรมเกี่ยวกับงาน Data Science เป็นเรื่องที่ง่ายขึ้น แม้เราจะไม่มีความรู้ด้านคณิตศาสตร์หรือสถิติระดับสูง ก็สามารถเขียนโปรแกรมจัดการงาน Data Science ด้วย Python ได้โดยง่าย นอกจากนี้ยังอธิบายถึงการทำ Data Visualization ซึ่งเป็นรูปแบบหนึ่งของการนำเสนอข้อมูลในรูปแบบของกราฟหรือแผนภูมิ เพื่อสื่อสารให้ผู้อ่านข้อมูลเข้าใจข้อมูลได้ง่ายขึ้นด้วยตอนท้ายของหนังสือได้กล่าวถึง Machine Learning ให้ได้ทราบกัน โดยจะสอนการออกแบบโปรแกรม Machine Learning ด้วยภาษาไพธอน เพื่อสอนให้คอมพิวเตอร์เกิดการเรียนรู้และการพัฒนาจากประสบการณ์ จนกระทั่งสามารถสร้างโมเดลทำนายผลลัพธ์หรือตัดสินใจการทำงานได้ด้วยตนเองอย่างอัตโนมัติ ซึ่งการทำ Machine Learning ก็จะต้องอาศัยความรู้ด้าน Data Science เข้ามาช่วยงานด้วย",
    "Author":"อรพิน ประวัติบริสุทธิ์",
    "Year of publication":2021,
    "Price":355,
    "Picture":"9786162047886.jpg"
},{
    "ISBN":9786162048081,
    "Title":"คัมภีร์ภาษา C ฉบับสมบูรณ์",
    "Description":"คัมภีร์ภาษา C ฉบับสมบูรณ์ เล่มนี้ เป็นเวอร์ชั่นล่าสุดที่ได้ปรับปรุงเนื้อหาให้อัพเดตล่าสุดตามมาตรฐาน ISO นอกจากนี้ยังเพิ่มรายละเอียดเนื้อหาเกี่ยวกับโครงงานจัดการฐานข้อมูลพนักงานลงไปด้วย เพื่อให้ผู้อ่านได้เห็นตัวอย่างจริงของการนำภาษาซีไปประยุกต์ใช้งาน รวมถึงยังสอนการจัดการชุดซอร์สโค้ดและการทำงานกับ Git ด้วย อธิบายและใช้ภาพประกอบที่เห็นขั้นตอนต่างๆ อย่างชัดเจน ทำตามได้จริง จึงใช้ได้ทั้งการเรียนการสอนในชั้นเรียน และอ่านเพื่อศึกษาด้วยตัวเอง",
    "Author":"อรพิน ประวัติบริสุทธิ์",
    "Year of publication":2022,
    "Price":365,
    "Picture":"9786162048081.jpg"
},{
    "ISBN":9786162048104,
    "Title":"พัฒนา IoT บนแพลตฟอร์ม Arduino ด้วย ESP32",
    "Description":"พัฒนา IOT บนแพลตฟอร์ม Arduino ด้วย ESP32 เล่มนี้ เนื้อหาจะมุ่งเน้นไปที่การทำความเข้าใจและวิเคราะห์แบบเป็นขั้นเป็นตอน พร้อมทั้งลงมือปฏิบัติไปพร้อมๆ กัน ผู้อ่านจะได้เรียนรู้การเขียนโปรแกรมควบคุมบอร์ด ESP32 บนแพลตฟอร์ม Arduino IDE การเชื่อมต่อขา GPI0 รับส่งข้อมูลแบบ serial อุปกรณ์ sensor / actuator และอื่นๆ การควมคุมและสั่งงานด้วยมือถือ ทั้งโดยตรงและผ่าน cloud ตลอดจนเรื่องราวอื่นๆ ที่ควรรู้ เป็นตัวช่วยในการปูพื้นฐาน และเป็นตัวจุดประกายให้กับผู้ที่กำลังสนใจการพัฒนาอุปกรณ์สำหรับงานด้าน IoT ได้เข้าใจ และสามารถนำไปต่อยอดหรือประยุกต์กับงานต่างๆ ได้ พร้อมแนะนำ Arduino IDE 2.0 ใหม่ล่าสุด",
    "Author":"ภาสกร พาเจริญ",
    "Year of publication":2022,
    "Price":385,
    "Picture":"9786162048104.jpg"
},{
    "ISBN":9786162624964,
    "Title":"พัฒนาเว็บและเพิ่มลูกเล่นด้วย JavaScript",
    "Description":"แนะนาผู้อ่านในการออกแบบและพัฒนาแอพพลิเคชันสาหรับรันบนอุปกรณ์ที่ใช้ระบบปฏิบัติการ Android โดยใช้โปรแกรม Android Studio เป็นเครื่องมือหลักในการสร้างแอพ โดยครอบคลุมเนื้อหาตั้งแต่พื้นฐานเกี่ยวกับการสร้างและตกแต่งหน้าเว็บไซต์ แนะนาและเริ่มต้นเขียนโค้ดคาสั่ง JavaScript การกาหนดตัวแปร การใช้งานคาสั่งควบคุมต่าง ๆ การประกาศและใช้งานฟังก์ชันใน JavaScript การใช้งานคลาสและโมดูลในการตกแต่งสีและพื้นหลังให้หน้าเว็บ การเพิ่มลูกเล่นการแสดงภาพ ข้อความ และการแสดงเวลา การสร้างเครื่องมือควบคุมแบบต่าง ๆ และการจัดการฟอร์มด้วย JavaScript โดยมีการอธิบายขั้นตอนการออกแบบและสร้างหน้าเว็บ พร้อมตัวอย่างใช้งานจริงตลอดเล่ม อัพเดตล่าสุดมาตรฐาน ES8",
    "Author":"สุพจน์ สง่ากอง",
    "Year of publication":2019,
    "Price":199,
    "Picture":"9786162624964.jpg"
},{
    "ISBN":9786162626098,
    "Title":"สร้างและจัดการฐานข้อมูลสมัยใหม่ด้วย MongoDB",
    "Description":"สร้างและจัดการฐานข้อมูลสมัยใหม่ด้วย MongoDB เล่มนี้ ได้นำเสนอเนื้อหาตั้งแต่แนะนำให้รู้จักกับระบบฐานข้อมูล MongoDB การติดตั้งใช้งาน MongoDB Server Community เรียนรู้โครงสร้างของฐานข้อมูล ชนิดของข้อมูล และการใช้คำสั่งใน Command Line สร้าง อ่าน สืบค้น การอัปเดตและลบข้อมูล การรวมข้อมูลเพื่อคำนวณหาผลลัพธ์ การสร้างอินเด็กซ์ช่วยในการสืบค้นและทำงานกับข้อมูลได้อย่างรวดเร็ว การใช้ Regular Expression การกำหนดสิทธิ์ในการเข้าถึงฐานข้อมูล การสำรองและกู้คืนข้อมูล การจัดการ MongoDB ในแบบ GUI ด้วย MongoDB Compass การจัดการฐานข้อมูลบนคลาวด์โดยไม่ต้องติดตั้งเซิร์ฟเวอร์เองด้วย MongoDB Atlas การจัดการฐานข้อมูลด้วยภาษา PHP และ Python เพื่อเป็นพื้นฐานนำไปประยุกต์พัฒนาแอปพลิเคชันในระดับสูงต่อไป",
    "Author":"ปิยะ นากสงค์",
    "Year of publication":2020,
    "Price":229,
    "Picture":"9786162626098.jpg"
},{
    "ISBN":9786162626418,
    "Title":"บริหารและจัดการฐานข้อมูลด้วย SQL Server 2019",
    "Description":"เนื้อหาในหนังสือเล่มนี้จะพาคุณได้เรียนรู้จักการใช้งานโปรแกรมจัดการฐานข้อมูลตัวนี้ ตั้งแต่ขั้นตอนเริ่มต้น พร้อมยกตัวอย่างการใช้งาน ครอบคลุมเนื้อหาขั้นสูง ซึ่งเหมาะสำหรับองค์กร SME ต่าง ๆ ที่ต้องการใช้ฐานข้อมูลเพื่อเพิ่มประสิทธิภาพระบบองค์กรให้ดีมากยิ่งขึ้น รวมทั้งเหมาะสำหรับนักเรียนที่ต้องการเรียนรู้จักโปรแกรมจัดการฐานข้อมูลดี ๆ เพื่อที่จะนำไปใช้ในการทำงานในสถานศึกษา หรือเป็นประสบการณ์การทำงานต่อไปในอนาคต",
    "Author":"กอง บก. ปิยะ นากสงค์",
    "Year of publication":2021,
    "Price":279,
    "Picture":"9786162626418.jpg"
},{
    "ISBN":9786162626494,
    "Title":"จัดการฐานข้อมูลด้วย MySQL + MariaDB",
    "Description":"หนังสือ จัดการฐานข้อมูลด้วย MySQL + MariaDB เล่มนี้ ได้แนะนำให้รู้จักโปรแกรมฐานข้อมูล MariaDB/MySQL โดยเน้นในการใช้งานในลักษณะ Command Line คือการเรียนรู้คำสั่ง SQL เพื่อจัดการฐานข้อมูลเป็นหลัก เนื่องจากผู้เขียนคิดว่าเป็นสิ่งที่สำคัญสำหรับโปรแกรมเมอร์ทุกคน ถ้าเราจะเขียนโปรแกรมไม่ว่าภาษาอะไรเพื่อที่จะจัดการฐานข้อมูล แต่ไม่รู้คำสั่ง SQL การเขียนโปรแกรมนั้นก็จะค่อนข้างลำบากทีเดียว อย่างไรก็แล้วแต่ หนังสือเล่มนี้ยังมีเนื้อหาในส่วนของการใช้โปรแกรมจัดการฐานข้อมูลที่เป็นลักษณะ GUI ให้ศึกษาด้วย",
    "Author":"",
    "Year of publication":2021,
    "Price":229,
    "Picture":"9786162626494.jpg"
},{
    "ISBN":9786162626548,
    "Title":"ต่อยอดพัฒนาโมไบล์แอพด้วย Flutter + Firebase",
    "Description":"หนังสือ ต่อยอดพัฒนาโมไบล์แอพด้วย Flutter + Firebase เล่มนี้ ได้กล่าวถึงวิธีใช้งาน Firebase ร่วมกับ Flutter ซึ่งครอบคลุมสิ่งที่จำเป็นต้องทราบทั้งหมด โดยส่วนแรกได้แนะนำพื้นฐาน Flutter ด้านต่าง ๆ ที่จะต้องนำมาใช้งานกับ Firebase อาทิ การกำหนด Scoped Access เพื่อจำกัดการเข้าถึงข้อมูลได้เฉพาะวิดเจ็ตที่กำหนด (InheritedWidget และ Provider) พื้นฐานเกี่ยวกับ Future และ Stream และการใช้ StreamBuilder วิดเจ็ตเพื่อนำข้อมูลจาก Stream มาแสดงผล เป็นต้นส่วนที่สองของหนังสือได้แสดงตัวอย่างการสร้างแอพพลิเคชันโดยใช้ Firebase เริ่มต้นจากแนะนำวิธีติดตั้ง Firebase ลงในโปรเจ็กต์ ตัวอย่างการสร้างแอปพลิเคชันที่สามารถเขียนข้อมูล อ่านข้อมูล แก้ไขข้อมูล และลบข้อมูลในแบบเรียลไทม์ ตัวอย่างแอปพลิเคชันที่มีระบบล็อกอิน โดยใช้อีเมลและรหัสผ่านร่วมกับบริการ Firebase Authentication เหมาะสำหรับ นักเรียน นักศึกษา และผู้สนใจที่มีพื้นฐานสร้างแอพด้วย Flutter มาก่อน",
    "Author":"จีราวุธ วารินทร์",
    "Year of publication":2021,
    "Price":229,
    "Picture":"9786162626548.jpg"
},{
    "ISBN":9786162627293,
    "Title":"Arduino Uno + ตัวอย่างงาน IoT",
    "Description":"หนังสือ Arduino UNO เล่มนี้ ได้อธิบายถึงวิธีใช้งาน Arduino ในระดับพื้นฐาน เริ่มจากแนะนำความรู้เกี่ยวกับภาษา C/C++ สำหรับเขียนโค้ดควบคุม Arduino จากนั้นได้กล่าวถึงวิธีการต่อวงจร, การวัดค่าอินพุต วิธีควบคุมเอาต์พุต, ตัวอย่างการใช้งานเซนเซอร์ยอดนิยม, วิธีแสดงผลในแบบต่าง ๆ, วิธีควบคุมมอเตอร์กระแสตรง, สเต็ปเปอร์มอเตอร์ และเซอร์โวมอเตอร์ ภายในเล่มยังได้อธิบายวิธีการติดตั้งซอฟต์แวร์สำหรับติดต่อสื่อสารกับ Arduino ทั้งในเครื่องคอมพิวเตอร์พีซีและเครื่องแมคอินทอช จากนั้นก็ได้แนะนำวิธีทดลองการใช้งาน Arduino และการสร้างโปรเจ็กต์แบบง่าย ๆ ซึ่งพื้นฐานเหล่านี้สามารถนำไปประยุกต์ใช้งานต่อยอดการสร้างสรรค์อื่น ๆ เพิ่มเติมได้",
    "Author":"กอง บก. ปิยะ นากสงค์",
    "Year of publication":2022,
    "Price":229,
    "Picture":"9786162627293.jpg"
},{
    "ISBN":9786162627361,
    "Title":"พัฒนาเว็บและเพิ่มลูกเล่นด้วย JavaScript",
    "Description":"",
    "Author":"สุพจน์ สง่ากอง,ปิยะ นากสงค์",
    "Year of publication":2022,
    "Price":229,
    "Picture":"9786162627361.jpg"
},{
    "ISBN":9786164871748,
    "Title":"Practical DevOps and Cloud Engineering",
    "Description":"หนังสือ Practical DevOps and Cloud Engineering เล่มนี้ เป็นคู่มือพัฒนาทักษะทางด้าน Practical DEVOPS and Cloud Engineering ภาคปฏิบัติ มีจุดประสงค์เพื่อพัฒนาทักษะ 2 ด้าน คือ Reskill (การเสริมทักษะใหม่เพื่อรองรับอนาคต) และ Upskill (การพัฒนาทักษะที่มีอยู่ให้ดีขึ้นตามที่บริษัทต้องการ) โดยเน้นการพัฒนาซอฟต์แวร์ผ่าน Practice & Workshop ภายใต้แนวคิดใหม่อย่าง Microservices Architecture (Design-Develop-Deploy) เพื่อให้ผู้อ่านมีแนวทางที่จะนำความรู้และทักษะที่ได้จากหนังสือเล่มนี้ไปประยุกต์ใช้ได้ในการทำงานจริงหนังสือเล่มนี้จึงเหมาะสำหรับนักศึกษา โปรแกรมเมอร์ นักพัฒนาซอฟต์แวร์ และผู้ที่อยากข้ามสายงานมาทำงานทางด้าน DevOps Engineer/Cloud DevOps Engineer สายงานที่มีบทบาทสำคัญต่อการพัฒนาผลิตภัณฑ์ที่เป็นซอฟต์แวร์ และเป็นที่ต้องการมากที่สุดอาชีพหนึ่งในปัจจุบัน",
    "Author":"ดร. ณัฐโชติ พรหมฤทธิ์",
    "Year of publication":2020,
    "Price":545,
    "Picture":"9786164871748.jpg"
},{
    "ISBN":9786164872561,
    "Title":"เริ่มต้น Coding สร้าง Mobile App อย่างมืออาชีพด้วย Kotlin และ Andriod Studio",
    "Description":"เรียนรู้หลักการสร้างแอปพลิเคชัน Android ด้วยภาษา Kotlin โดยใช้ Android Studio อธิบายตั้งแต่การติดตั้งโปรแกรม การใช้เครื่องมือ หลักการพัฒนาแอปพลิเคชันในรูปแบบต่าง ๆ ไม่ว่าจะเป็นการใช้งาน Widget, Layout แบบต่าง ๆ ระบบเมนู, Mobile Davices เช่น กล้องถ่ายรูป ฯลฯ, Google Map, การจัดการฐานข้อมูล SQLite ด้วย Room, การสร้างแอนิเมชันด้วย Motion Layout ตลอดจนสามารถสร้างแอพบน Play Store ได้จริง มีตัวอย่างประกอบทุกหัวข้อ สามารถดาวน์โหลดซอสโค้ดประกอบการอธิบายได้ฟรี",
    "Author":"ศุภชัย สมพานิช",
    "Year of publication":2021,
    "Price":360,
    "Picture":"9786164872561.jpg"
},{
    "ISBN":9786164872745,
    "Title":"Fundamental of Deep Learning in Practice",
    "Description":" หนังสือที่จะปูพื้นฐานที่จำเป็นสำหรับผู้เริ่มต้นศึกษาด้าน AI และ Deep Learning โดยมุ่งให้ผู้อ่านสามารถทำความเข้าใจแนวคิดที่เป็นรากฐานไปจนถึงขั้นการฝึกสอน Model เพื่อนำไปใช้งานทางด้านภาพ การเล่นเกม และระบบการแนะนำ ด้วยการลงมือเขียน Code ภาษา Python บน Jupyter Notebook โดยใช้ Library ต่าง ๆ อย่างเช่น TensorFlow, Scikit-learn และ NumPy ในยุคที่ AI และ Data Science ได้เข้ามามีบทบาทสำคัญในการขับเคลื่อนเศรษฐกิจโลก เนื้อหาในเล่มจะช่วย Upskill Reskill ให้แก่นักศึกษา บุคลากรในภาคอุตสาหกรรมดิจิทัล รวมทั้งผู้ที่สนใจในงานทางด้านนี้ได้เป็นอย่างดี!",
    "Author":"ดร. ณัฐโชติ พรหมฤทธิ์, ดร. สัจจาภรณ์ ไวจรรยา",
    "Year of publication":2021,
    "Price":545,
    "Picture":"9786164872745.jpg"
},{
    "ISBN":9786164873056,
    "Title":"Fundamental of Software Engineering & Digital Transformation",
    "Description":"Fundamental of Software Engineering & Digital Transformation เล่มนี้ เป็นหนังสือที่รวบรวมหลักทฤษฎีวิศวกรรมซอฟต์แวร์ (Software Engineering) และประยุกต์ ซึ่งเป็นเครื่องมือสำคัญในการที่องค์กรจะปรับเปลี่ยนสู่ดิจิทัล (Digital Transformation) ซึ่งต้องอาศัยความรู้และความเข้าใจในหลายมิติ นอกจากนี้ยังได้รวบรวมแนวคิดในการพัฒนาซอฟต์แวร์แบบใหม่ ๆ และกรณีศึกษา เพื่อให้ผู้อ่านได้ก้าวทันตามการเปลี่ยนแปลงของเทคโนโลยีด้านวิศวกรรมซอฟต์แวร์ ที่มีบทบาทอย่างมากในการปรับเปลี่ยนสู่ดิจิทัล หนังสือเล่มนี้จะเป็นประโยชน์ต่อการพัฒนาองค์กรดิจิทัล หรือได้มีส่วนร่วมที่ทำให้การพัฒนาซอฟต์แวร์ของประเทศให้ประสบผลสำเร็จ",
    "Author":"รศ.ดร. ปานใจ ธารทัศนวงศ์",
    "Year of publication":2022,
    "Price":450,
    "Picture":"9786164873056.jpg"
},{
    "ISBN":9786169065173,
    "Title":"เรียนรู้ AI : Deep Learning ด้วย Python",
    "Description":" AI เป็นเทคโนโลยีที่เข้ามามีบทบาทสำคัญต่อธุรกิจการทำงานและการใช้ชีวิตยุคปัจจุบันและอนาคต Deep Learning เป็นกลไกสำคัญที่อยู่เบื้องหลังทำให้ AI มีความซาญฉลาดจนน่าทึ่งหนังสือเล่มนี้ เรียบเรียงขึ้นสำหรับผู้เริ่มต้นเรียน Deep Learning แบบ Step-by-Step เน้นการเรียนรู้ด้วยการฝึกปฏิบัติ Workshop จากโค้ดตัวอย่าง การใช้เครื่องมือไลบรารีที่สำคัญ TensorFlow Keras เนื้อหาครอบคลุมตั้งแต่การติดตั้งระบบ พื้นฐานที่สำคัญ จนถึงการประยุกต์ใช้งาน ซึ่งการเรียนรู้ที่ดีจะไม่เพียงแค่ใช้ไลบรารีเป็นเท่านั้น ผู้ศึกษาจะต้องเรียนรู้หลักการหัวใจสำคัญด้วย ดังนั้น เนื่อหาจึงได้สอดแทรกทฤษฎีที่สำคัญเอาไว้ โดยใช้ภาษาที่เข้าใจง่าย มีส่วนที่เป็นคณิตศาสตร์น้อยที่สุด เน้นรูปภาพให้เข้าใจง่าย เหมาะสำหรับผู้เริ่มต้น",
    "Author":"ผศ.ดร. กอบเกียรติ สระอุบล",
    "Year of publication":2022,
    "Price":385,
    "Picture":"9786169065173.jpg"
},{
    "ISBN":9786169075783,
    "Title":"เรียนรู้ Data Science และ AI : Machine Learning ด้วย Python",
    "Description":"หนังสือเล่มนี้เหมาะสำหรับผู้เริ่มต้นเรียนรู้ Data Science ศาสตร์ที่ว่าด้วยการนำเอาข้อมูลมาใช้ให้เกิดประโยชน์ในงานด้านต่างๆ อย่างสูงสุด และเรียนรู้ด้าน AI (Artificial Intelligence) หรือปัญญาประดิษฐ์ Machine Learning ด้วยภาษา Python เพื่อพัฒนาระบบอัจฉริยะ เน้นการเรียนรู้ด้วยการปฏิบัติ Workshopเนื้อหาในเล่มนำเสนอตั้งแต่ระดับเริ่มต้น เริ่มจากการติดตั้งซอฟต์แวร์ ไลบรารี พื้นฐาน Python สำหรับ Data Science และ AI:Machine Learning สถิติเบื้องต้น การเตรียมข้อมูล การสร้างมโนทัศข้อมูล (Data Visualization) การวิเคราะห์และสรุปข้อมูล การสร้างระบบเรียนรู้ของเครื่อง (Machine Learning) อัลกอรึทึมที่สำคัญเช่น Regression, Na?ve Bayes, Logistic Regression, Decision Tree, SVM, k-Means Clustering การประเมินและปรับแต่ง Model หาค่าที่ดีที่สุด ROC AUC การลดมิติข้อมูล ตัวอย่างระบบรู้จำลายมือตัวเลข ระบบรู้จำใบหน้า ไปจนถึงระบบแนะนำภาพยนตร์ และอีกหลากหลายเรื่องราวน่าสนใจ",
    "Author":"ผศ.ดร. กอบเกียรติ สระอุบล",
    "Year of publication":2020,
    "Price":365,
    "Picture":"9786169075783.jpg"
},{
    "ISBN":9786169375302,
    "Title":"ตะลุยโจทย์ Python 500 ข้อ พร้อมเฉลยอย่างละเอียด",
    "Description":"รวมโจทย์ Python 500 ข้อ ที่ถูกออกแบบมาให้ครอบคลุมหัวข้อสำคัญซึ่งจำเป็นต่อการเรียนรู้อย่างครบถ้วน พร้อมเฉลยอย่างละเอียด โจทย์จะมีการไล่ระดับ เริ่มจากระดับง่ายก่อน เพื่อให้เกิดความคุ้นเคยกับโครงสร้างภาษา ไปจนถึงระดับยาก เพื่อให้เกิดการประยุกต์และพัฒนาทักษะการเขียนโปรแกรมในระดับที่สูงขึ้นความพิเศษของหนังสือเล่มนี้ ได้แก่- วิดีโอสอนการเขียน Python พร้อมอธิบายแบบฝึกหัดความยาวกว่า 30 ชั่วโมงบน Youtube Chanel- สไลด์ประกอบการสอน เนื้อหาอัดแน่นกว่า 250 หน้า- Source Code เฉลยของโจทย์ทุกข้อใน Jupyter Notebook- Facebook group สำหรับสอบถามข้อมูล และแลกเปลี่ยนความคิดเห็น- ลิงก์รวบรวมตำแหน่งงานในสายงานภาษา Python อัพเดทแบบ Real Time(ทั้งหมดนี้ไม่มีการคิดค่าใช้จ่ายเพิ่มเติม)",
    "Author":"ฆฤณ ชินประสาทศักดิ์",
    "Year of publication":2021,
    "Price":495,
    "Picture":"9786169375302.jpg"
},{
    "ISBN":9789744438317,
    "Title":"IoT เบื้องต้นบน NodeMCU",
    "Description":"แนะนำการเชื่อมต่อ NodeMCU ESP8266 กับอุปกรณ์อินพุต-เอาต์พุต เช่น หลอด LED ตัวต้านทานแบบปรับค่าได้ ตัวต้านทานแบบปรับค่าตามแสง จอ LCD แบบ I2C จอแสดงผล 7-Segment รวมทั้งการเชื่อมต่อกับเซนเซอร์ต่าง ๆ เช่น เซนเซอร์ตรวจจับความเคลื่อนไหว เซนเซอร์วัดแสง เซนเซอร์วัดระยะทาง ฯลฯ พร้อมตัวอย่างการเขียนโปรแกรมควบคุมการทำงานของแต่ละอุปกรณ์ และตอนท้ายเป็นการประยุกต์ IoT โดยควบคุมการเคลื่อนที่ของหุ่นยนต์ด้วยสมาร์ทโฟนผ่านแอปพลิเคชัน Blynk และการแจ้งเตือนปริมาณฝุ่น PM2.5 ผ่านแอปพลิเคชัน LINE",
    "Author":"ผศ. ดอนสัน ปงผาบ",
    "Year of publication":2022,
    "Price":250,
    "Picture":"9789744438317.jpg"
}]